// Task_1 ======================================================
// Реализовать алгоритм QuickSort, когда в качестве опорного элемента (pivot) мы выбираем не последний элемент в массиве, а случайный.

// Task_2 ======================================================
// ЗадачкаДан массив строк. Нужно найти самый длинный общий префикс, используя парадигму DivideAndConquer.

// Пример,
// arr = ["return","retard","reunion","rest"]
// prefix = "re"

// arr = ["cheer", "cheerful", "cheese"]
// prefix = "chee"

// arr = ["mirror", "nothing"]
// prefix = ""
